AcRxBoxedValue.comparedTo(AcRxObject!System.Runtime.CompilerServices.IsConst*)
For internal use only.

AcRxBoxedValue.isEqualTo(AcRxObject!System.Runtime.CompilerServices.IsConst*)
This method can be used to compare to boxed values.
other:
Input pointer to object to be compared with this object.
Returns:
Returns true if the values are same; otherwise, returns false.

AcRxBoxedValue.copyFrom(AcRxObject!System.Runtime.CompilerServices.IsConst*)
Copies the contents of other into this object, whenever feasible.
other:
Input pointer to object to copy from.
Returns:
Returns Acad::eOk if successful; otherwise, returns an AutoCAD error status.

AcRxBoxedValue.clone
This function creates a clone of the object and returns a pointer to the clone.
If the function is not successful in creating the clone, then NULL is returned.
Returns:
Returns pointer to the clone if successful; otherwise it returns NULL.

AcRxBoxedValue.newBoxedValueOnHeap(AcRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This function can be used to created heap resident instance of AcRxBoxedValue
object.
value:
Reference to the AcRxValue object that needs to boxed.
Returns:
Returns pointer to the AcRxBoxedValue object that was created on the heap.

AcRxBoxedValue.value
Returns the value that is boxed. The derived class must implement this method.
Returns:
Returns const reference to an AcRxValue object.
Returns the value that is boxed. The derived class must implement this method.
Returns:
Returns reference to an AcRxValue object.

AcRxBoxedValue
This is the base class for all boxed types. This class can be used to wrap
the AcRxValue in an AcRxObject. There are instances where we need to treat the
non-AcRxObject derived object as an AcRxObject. An example is querying the
properties of AcGePoint3d which is a non-AcRxObject derived type. In this case we
can box the AcGePoint3d value, pass the AcRxBoxedValue object that is obtained
to the property engine to get its properties.